app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY date
---
  def index
    @tasks = Task.order(:date)

INSERT INTO "tasks" ("created_at", "date", "description", "done", "id_user", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @task = Task.new(params[:task])
    @task.id_user = current_user.id
    respond_to do |format|
      if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "done" = 't', "date" = '2013-06-04 18:11:00.000000', "updated_at" = '2013-06-05 18:13:04.511160' WHERE "tasks"."id" = 1
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])